{
  "intro": "Patch notes for Snippit. Latest changes are at the top. (these patch notes and versions start at the release of the patch notes system)",
  "versions": [
    {
      "version": "0.2.1",
      "date": "2025-12-26",
      "notes": [
        "Home screen: game mode cards are now fully opaque (no transparency).",
        "Patch Notes: opening the Patch Notes screen now always scrolls to the top."
      ]
    },
    {
      "version": "0.2.0",
      "date": "2025-12-26",
      "notes": [
        "Added Reveal mode: start with a very zoomed-in snippit and zoom out each round until you guess the location.",
        "Reveal mode supports Classic and Timer play styles, with a 5km win condition and 10 rounds.",
        "Intro overlays for all modes now have colored backgrounds and improved visual polish.",
        "Summary overlays now use emojis for win/game over/expert, and SVG crowns are replaced with emoji.",
        "Reveal mode summary popup now includes a Back button.",
        "Reveal mode: after closing the summary, the Guess button becomes a Show summary button so you can reopen the popup.",
        "UI: Retry buttons now read \"Retry\" on losses and \"Play again\" on wins (keeping the spinning icon).",
        "Bugfix: Reveal mode no longer shows the actual location during guessing rounds (only on win/game over).",
        "Bugfix: Reveal mode now starts more zoomed in for extra challenge.",
        "UI: Various small layout and accessibility improvements."
      ]
    },
    {
      "version": "0.1.0",
      "date": "2025-12-26",
      "notes": [
        "Home screen: replaced the mode buttons layout with a swipeable/clickable card deck.",
        "Home screen: clicking side cards now brings them to the front; clicking the front card opens the mode intro.",
        "Home screen: improved responsiveness so the deck switches to a vertical stack earlier to prevent off-screen cards.",
        "Home screen: added vertical swipe (up/down) support when the deck is in vertical layout.",
        "Home screen: tightened vertical layout sizing/spread on short screens to avoid overlapping the title or bottom bar.",
        "Home screen: slowed the Snippit title animation so it’s easier to see on page load/reload."
      ]
    },
    {
      "version": "0.0.0",
      "date": "2025-12-24",
      "notes": [
        "Added a Patch Notes screen (on the home screen) and a Patch Notes button.",
        "Patch notes now load from patch-notes.json so they can be updated without touching the code.",
        "Updated the \"What is Snippit?\" / Help screen with clearer sections (including an overview of the modes).",
        "Added a shared \"Points info\" popup that explains how points work.",
        "Merged Points into Classic as a Play style (Classic + Points). The old Points card now shows \"Coming soon…\".",
        "Home bottom bar polish: patch notes icon support, responsive sizing on resize, and updated the credit-pill confetti effect.",
        "Performance improvements for smoother mobile play (reduced heavy UI updates and tuned map rendering)."
      ]
    }
  ]
}
