{
  "intro": "Patch notes for Snippit. Latest changes are at the top. (these patch notes and versions start at the release of the patch notes system)",
  "versions": [
    {
      "version": "0.3.0",
      "date": "2025-12-31",
      "notes": [
        "New game mode: Radar mode! Analyze a radar chart showing location characteristics (climate, elevation, coastal proximity, latitude, urban density, rainfall, and remoteness) to pinpoint where in the world the location is.",
        "Radar mode features 120 unique locations and supports both Classic (untimed) and Points (timed with scoring) play styles.",
        "Radar mode uses a new cobalt blue theme color for its card, intro screen, and radar chart visualization.",
        "Radar chart now displays smooth curved lines with adaptive corner rounding instead of straight lines or forced curves.",
        "Questions mode expanded from 159 to 200 trivia questions covering world geography, history, and culture.",
        "Points modes: Result popup now shows a cleaner counter format: 'Round X/10 • Y/1000 pts' displayed below the guess location.",
        "Reveal mode: Round counter now uses the same styling as Points modes for visual consistency.",
        "Removed old counter displays from result popups in favor of the new unified counter style.",
        "Home screen now supports 4 game mode cards in the fanned deck layout."
      ]
    },
    {
      "version": "0.2.4",
      "date": "2025-12-31",
      "notes": [
        "Home screen: Game mode cards now use a fanned/stacked deck layout on windows up to 720px wide, with cards peeking out from the left side for easier access and better visibility.",
        "The peeking cards now show more of their surface, including their colored corner dots, making them easier to click.",
        "The fanned deck is always centered and dynamically adjusts to fit all cards within the home deck area, so adding new game modes will automatically keep the layout balanced.",
        "Swiping and clicking on cards now animates a smooth flip/rearrange effect in the stacked layout.",
        "Wide window layout is unchanged."
      ]
    },
    {
      "version": "0.2.3",
      "date": "2025-12-30",
      "notes": [
        "Removed the \"Click on this map to place a guess!\" popup and all related logic from all game modes.",
        "Removed the floating round indicator (pill) from Points and Reveal modes; round progress is now shown inside the result popup instead.",
        "Reveal mode: guess history is now preserved across rounds—your previous guesses remain visible on the map for the whole session.",
        "Reveal mode: round progress is now shown in the result popup, including after timeouts.",
        "Points and Reveal: round does not auto-advance on timer expiry; instead, a \"too late\" message is shown and you must click Next/Zoom Out to continue.",
        "Points: on Expert difficulty, running out of time still ends the game immediately.",
        "UI: various small layout and accessibility improvements."
      ]
    },
    {
      "version": "0.2.2",
      "date": "2025-12-30",
      "notes": [
        "Intro overlays: play style/difficulty selectors now use a cleaner round indicator style.",
        "Help (?): the home screen help button now stays fixed in the bottom-right when opening a game mode intro (Classic / Questions / Reveal).",
        "Patch Notes button is back next to the Help button on the home screen, and it only shows on the home screen.",
        "UI: fixed the Help + Patch Notes buttons overlapping."
      ]
    },
    {
      "version": "0.2.1",
      "date": "2025-12-26",
      "notes": [
        "Home screen: game mode cards are now fully opaque (no transparency).",
        "Patch Notes: opening the Patch Notes screen now always scrolls to the top."
      ]
    },
    {
      "version": "0.2.0",
      "date": "2025-12-26",
      "notes": [
        "Added Reveal mode: start with a very zoomed-in snippit and zoom out each round until you guess the location.",
        "Reveal mode supports Classic and Timer play styles, with a 5km win condition and 10 rounds.",
        "Intro overlays for all modes now have colored backgrounds and improved visual polish.",
        "Summary overlays now use emojis for win/game over/expert, and SVG crowns are replaced with emoji.",
        "Reveal mode summary popup now includes a Back button.",
        "Reveal mode: after closing the summary, the Guess button becomes a Show summary button so you can reopen the popup.",
        "UI: Retry buttons now read \"Retry\" on losses and \"Play again\" on wins (keeping the spinning icon).",
        "Bugfix: Reveal mode no longer shows the actual location during guessing rounds (only on win/game over).",
        "Bugfix: Reveal mode now starts more zoomed in for extra challenge.",
        "UI: Various small layout and accessibility improvements."
      ]
    },
    {
      "version": "0.1.0",
      "date": "2025-12-26",
      "notes": [
        "Home screen: replaced the mode buttons layout with a swipeable/clickable card deck.",
        "Home screen: clicking side cards now brings them to the front; clicking the front card opens the mode intro.",
        "Home screen: improved responsiveness so the deck switches to a vertical stack earlier to prevent off-screen cards.",
        "Home screen: added vertical swipe (up/down) support when the deck is in vertical layout.",
        "Home screen: tightened vertical layout sizing/spread on short screens to avoid overlapping the title or bottom bar.",
        "Home screen: slowed the Snippit title animation so it’s easier to see on page load/reload."
      ]
    },
    {
      "version": "0.0.0",
      "date": "2025-12-24",
      "notes": [
        "Added a Patch Notes screen (on the home screen) and a Patch Notes button.",
        "Patch notes now load from patch-notes.json so they can be updated without touching the code.",
        "Updated the \"What is Snippit?\" / Help screen with clearer sections (including an overview of the modes).",
        "Added a shared \"Points info\" popup that explains how points work.",
        "Merged Points into Classic as a Play style (Classic + Points). The old Points card now shows \"Coming soon…\".",
        "Home bottom bar polish: patch notes icon support, responsive sizing on resize, and updated the credit-pill confetti effect.",
        "Performance improvements for smoother mobile play (reduced heavy UI updates and tuned map rendering)."
      ]
    }
  ]
}
